#include <iostream>

using namespace std;

int main()
{
	cout<<"Фантазия кончилась, голова не работает, хочу спаааать )="<<endl;
	cout<<"|---------------------------------|"<<endl;
	cout<<"|**********|**|*******************|"<<endl;
	cout<<"|************|********************|"<<endl;
	cout<<"|***********|*|*******************|"<<endl;
	cout<<"|**********|***|******************|"<<endl;
	cout<<"|*********|*****|*****************|"<<endl;
	cout<<"|********|*******|****************|"<<endl;
	cout<<"|---------------------------------|"<<endl;
	return 0;
}